rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "AAA"]]
---
  def same_director
    id = params[:id]
    movie = Movie.find(id)
    if movie.director?
      @movies = Movie.where(director: movie.director)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "movies" SET "title" = ?, "rating" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Space Balls"], ["rating", "PG"], ["release_date", "1987-06-24 00:00:00.000000"], ["updated_at", "2018-10-06 04:39:35.101693"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)